<?php

namespace Database\Seeders;

use App\Models\FaqCategory;
use App\Models\FaqQuestion;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class FAQTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        FaqCategory::insert(['id'=>1,'category'=>'general']);

        FaqQuestion::insert(
            [
                [
                    'category_id' => 1,
                    'question' => 'ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة.؟',
                    'answer' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. كبر من الفقرات يتيح لك مولد النص العربى زيادة عدد',
                ],
                [
                    'category_id' => 1,
                    'question' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    'answer' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. كبر من الفقرات يتيح لك مولد النص العربى زيادة عدد',
                ],
                [
                    'category_id' => 1,
                    'question' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    'answer' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. كبر من الفقرات يتيح لك مولد النص العربى زيادة عدد',
                ],
                [
                    'category_id' => 1,
                    'question' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    'answer' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. كبر من الفقرات يتيح لك مولد النص العربى زيادة عدد',
                ],
                [
                    'category_id' => 1,
                    'question' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة',
                    'answer' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق. كبر من الفقرات يتيح لك مولد النص العربى زيادة عدد',
                ],
            ]
        );
    }
}
