<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServicesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Service::insert(
            [
                [ 
                    'id'      => 1,  
                    'name'      => 'مكافحة الحشرات الزاحفة',  
                    'short_description'      => 'الحشرات الزاحفة مثل الصراصير وتنقسم انواع الصراصير الى الصرصور الامريكي وهو كبير الحجم ودائما يكون مصدرها', 
                    'description' => 'الحشرات الزاحفة مثل الصراصير وتنقسم انواع الصراصير الى الصرصور الامريكي وهو كبير الحجم ودائما يكون مصدرها غرف التفتيش في الخارج وتتم اعمال المكافحة بمبيدات ذات رائحة قوية وفعالة يتم رشها في غرف التفتيش الخارجية . النوع الثاني الصرصور الالماني وحجمه صغير وتكون في الداخل وخصوصا في المطابخ ومن هنا يجب التأكد من فحص أي مشتريات خارجية لأنها قد تحمل بيض للصراصير والحشرات وتتم مكافحتها باستخدام مبيدات فعالة وبدون رائحة ويتم التركيز في الرش على المطابخ وفتحات التصريف الداخلية والحمامات ويمكن استخدام مواد جيلاتينية بدون رائحة يتم وضعها في اماكن مخفية تقضى على الصراصير أما بق الفراش فيستخدم لمكافحته مبيدات خاصة تتكفل بالقضاء عليه', 
                ],
                [ 
                    'id'      => 2,  
                    'name'      => 'البرص والوزغ',  
                    'short_description' => 'هو من الزواحف التي تعتبر من الحيوانات التي تنقل الامراض بما تحمل من بكتريا خطيرة في اجسامها ولذلك',
                    'description' => 'الحشرات الزاحفة مثل الصراصير وتنقسم انواع الصراصير الى الصرصور الامريكي وهو كبير الحجم ودائما يكون مصدرها غرف التفتيش في الخارج وتتم اعمال المكافحة بمبيدات ذات رائحة قوية وفعالة يتم رشها في غرف التفتيش الخارجية . النوع الثاني الصرصور الالماني وحجمه صغير وتكون في الداخل وخصوصا في المطابخ ومن هنا يجب التأكد من فحص أي مشتريات خارجية لأنها قد تحمل بيض للصراصير والحشرات وتتم مكافحتها باستخدام مبيدات فعالة وبدون رائحة ويتم التركيز في الرش على المطابخ وفتحات التصريف الداخلية والحمامات ويمكن استخدام مواد جيلاتينية بدون رائحة يتم وضعها في اماكن مخفية تقضى على الصراصير أما بق الفراش فيستخدم لمكافحته مبيدات خاصة تتكفل بالقضاء عليه', 
                ],
                [ 
                    'id'      => 3,  
                    'name'      => 'الحشرات الطائرة',  
                    'short_description' => 'تتم مكافحة الناموس باستخدام الضباب الحرارى عند الصباح الباكر وعند الغروب وتتم مكافحة الذباب باستخدام طعوم ومصائد للقضاء عليه',
                    'description' => 'الحشرات الزاحفة مثل الصراصير وتنقسم انواع الصراصير الى الصرصور الامريكي وهو كبير الحجم ودائما يكون مصدرها غرف التفتيش في الخارج وتتم اعمال المكافحة بمبيدات ذات رائحة قوية وفعالة يتم رشها في غرف التفتيش الخارجية . النوع الثاني الصرصور الالماني وحجمه صغير وتكون في الداخل وخصوصا في المطابخ ومن هنا يجب التأكد من فحص أي مشتريات خارجية لأنها قد تحمل بيض للصراصير والحشرات وتتم مكافحتها باستخدام مبيدات فعالة وبدون رائحة ويتم التركيز في الرش على المطابخ وفتحات التصريف الداخلية والحمامات ويمكن استخدام مواد جيلاتينية بدون رائحة يتم وضعها في اماكن مخفية تقضى على الصراصير أما بق الفراش فيستخدم لمكافحته مبيدات خاصة تتكفل بالقضاء عليه', 
                ],
                [ 
                    'id'      => 4,  
                    'name'      => 'القوارض',  
                    'short_description' => 'الفئران والجرذان من القوارضالتي تسبب كثير من الخسائر والأمراض وتتوالد اكثر من 6 مرات في العالم وتسبب كثير من الامراض الخطيرة ...',
                    'description' => 'الحشرات الزاحفة مثل الصراصير وتنقسم انواع الصراصير الى الصرصور الامريكي وهو كبير الحجم ودائما يكون مصدرها غرف التفتيش في الخارج وتتم اعمال المكافحة بمبيدات ذات رائحة قوية وفعالة يتم رشها في غرف التفتيش الخارجية . النوع الثاني الصرصور الالماني وحجمه صغير وتكون في الداخل وخصوصا في المطابخ ومن هنا يجب التأكد من فحص أي مشتريات خارجية لأنها قد تحمل بيض للصراصير والحشرات وتتم مكافحتها باستخدام مبيدات فعالة وبدون رائحة ويتم التركيز في الرش على المطابخ وفتحات التصريف الداخلية والحمامات ويمكن استخدام مواد جيلاتينية بدون رائحة يتم وضعها في اماكن مخفية تقضى على الصراصير أما بق الفراش فيستخدم لمكافحته مبيدات خاصة تتكفل بالقضاء عليه', 
                ],
                [ 
                    'id'      => 5,  
                    'name'      => 'الحيوانات الضالة',  
                    'short_description' => '...',
                    'description' => 'الحشرات الزاحفة مثل الصراصير وتنقسم انواع الصراصير الى الصرصور الامريكي وهو كبير الحجم ودائما يكون مصدرها غرف التفتيش في الخارج وتتم اعمال المكافحة بمبيدات ذات رائحة قوية وفعالة يتم رشها في غرف التفتيش الخارجية . النوع الثاني الصرصور الالماني وحجمه صغير وتكون في الداخل وخصوصا في المطابخ ومن هنا يجب التأكد من فحص أي مشتريات خارجية لأنها قد تحمل بيض للصراصير والحشرات وتتم مكافحتها باستخدام مبيدات فعالة وبدون رائحة ويتم التركيز في الرش على المطابخ وفتحات التصريف الداخلية والحمامات ويمكن استخدام مواد جيلاتينية بدون رائحة يتم وضعها في اماكن مخفية تقضى على الصراصير أما بق الفراش فيستخدم لمكافحته مبيدات خاصة تتكفل بالقضاء عليه', 
                ],
                [ 
                    'id'      => 6,  
                    'name'      => 'النمل الابيض',  
                    'short_description' => '...',
                    'description' => 'الحشرات الزاحفة مثل الصراصير وتنقسم انواع الصراصير الى الصرصور الامريكي وهو كبير الحجم ودائما يكون مصدرها غرف التفتيش في الخارج وتتم اعمال المكافحة بمبيدات ذات رائحة قوية وفعالة يتم رشها في غرف التفتيش الخارجية . النوع الثاني الصرصور الالماني وحجمه صغير وتكون في الداخل وخصوصا في المطابخ ومن هنا يجب التأكد من فحص أي مشتريات خارجية لأنها قد تحمل بيض للصراصير والحشرات وتتم مكافحتها باستخدام مبيدات فعالة وبدون رائحة ويتم التركيز في الرش على المطابخ وفتحات التصريف الداخلية والحمامات ويمكن استخدام مواد جيلاتينية بدون رائحة يتم وضعها في اماكن مخفية تقضى على الصراصير أما بق الفراش فيستخدم لمكافحته مبيدات خاصة تتكفل بالقضاء عليه', 
                ],
            ]
        ); 
    }
}
